Courses/4420/Lectures/Hardening/SELinux/selinux-ubuntu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Exploration of SELinux as installed on Ubuntu</title>
<!-- 2018-11-27 Tue 19:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">Exploration of SELinux as installed on Ubuntu</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Prerequisites for this Section: DAC, MAC and SELinux.  Terminology:
Subjects (active entities, e.g., processes), verbs/ actions (e.g.,
read), objects (passive entities, e.g., files).  Roles, Labels and
Types.
</li>
</ol>


<ol class="org-ol">
<li>Caution: Improperly configured, SELinux may not permit the
completion of a boot.  A Drastic Measure that can Fix This:
Interact with Grub, and in the <code>linux ...</code> line, delete
<code>security=selinux</code> and delete <code>selinux=1</code>, insert <code>selinux=0</code> and
press F10.  Or boot from a multi boot USBD (of Lab L1), and edit
files in <code>hddroot/etc/selinux/</code>.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install SELinux on Ubuntu</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>SELinux is default on RedHat.  Ubuntu distribution uses AppArmor
instead; <code>apt purge apparmor</code>.  Then, <code>reboot</code>
</li>

<li><code>apt install selinux-*</code> [hyphen-asterisk].  [We are
over-doing!] May take a minute or two. 
</li>

<li><code>apt install selinux setools-gui auditd</code> [no-hyphens-no-asterisks].
Check what your prof installed on his machine: <a href="./sel-dpkg-list.txt">./sel-dpkg-list.txt</a>
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Config SELinux</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Configure selinux.  In the file <code>/etc/selinux/config</code>, set
<code>SELINUX</code> to <code>permissive</code>.
</li>

<li>Verify the Grub menu entry installed by <code>apt install selinux</code>
<div class="org-src-container">

<pre class="src src-bash">menuentry "Linux Kubuntu 18.10 security=selinux selinux=1" {
 linux /vmlinuz ro security=selinux selinux=1 root=LABEL=Kubuntu1810WD37 
 initrd /initrd.img
}
</pre>
</div>
</li>

<li><code>reboot</code> again.  During the next boot, SELinux builds and saves
contexts.  Will take longer than usual boot. 
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> After the Reboot Explore</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-bash">root@Milner:~# sestatus
SELinux status:                 enabled
SELinuxfs mount:                /sys/fs/selinux
SELinux root directory:         /etc/selinux
Loaded policy name:             default
Current mode:                   permissive
Mode from config file:          permissive
Policy MLS status:              enabled
Policy deny_unknown status:     allowed
Memory protection checking:     requested (insecure)
Max kernel policy version:      31

root@Milner:~# getenforce
Permissive
</pre>
</div>

<ol class="org-ol">
<li>The Grub menu that booted this session will have <code>security=selinux
   selinux=1</code> in it.
<pre class="example">
root@Sutherland:~# cat /proc/cmdline 
BOOT_IMAGE=/boot/vmlinuz-4.18.0-11-generic ro security=selinux selinux=1 root=LABEL=Kubuntu1810WD37 vt.handoff=1
</pre>
</li>

<li>In text file <code>/etc/selinux/config</code>, change <code>SELINUX=permissive</code> to
<code>SELINUX=enforcing</code>
</li>

<li>The command <code>setenforce Enforcing</code> enforces selinux. The command
<code>setenforce Permissive</code> flips selinux to being permissive.
</li>

<li>Available commands: <code>man -k selinux</code>  100+  For our labs, we need
just a few.
</li>

<li>After selinux install, config files on Ubuntu:
<ol class="org-ol">
<li><code>/etc/selinux/*</code>, 60+ files ??
</li>
<li><code>/etc/selinux.d/ubuntu/*</code> 50+ files ??
</li>
</ol>
</li>

<li><code>dpkg -L selinux</code> lists where the files from package named selinux
were installed.
</li>

<li>See the files in <code>/etc/selinux/default/contexts/</code> (These are text
files.)
</li>

<li>Policies are compiled into binary files.
<pre class="example">
root@Sutherland:~# file /etc/selinux/default/policy/policy.31 
/etc/selinux/default/policy/policy.31: SE Linux policy v31 8 symbols 9 ocons
</pre>
</li>

<li><code>default</code> is the name of the policy installed by the package named
<code>selinux-policy-default</code> The full collection of rules is at
<code>/usr/share/selinux/default</code>.  E.g., take a look at <code>bzcat
   /usr/share/selinux/default/keyboardd.pp.bz2</code>
</li>

<li>The .pp file is the result of <code>/usr/bin/semodule_package</code> working
on .mod and .te files.  It is possible to regenerate .mod and .te
files from .pp but it is way too cumbersome and skipped here.  See
<a href="https://android.googlesource.com/platform/external/selinux/+/9ef48ac/policycoreutils/semodule_package/">https://android.googlesource.com/platform/external/selinux/+/9ef48ac/policycoreutils/semodule_package/</a>
</li>

<li>Linux Security Modules (LSM) API: Dozens of access control hooks
all over the kernel; see <code>include/linux/security.h</code> An LSM, such as
SELinux, is compiled into the kernel.  Se the results of <code>grep
   selinx /proc/kallsyms</code>
</li>

<li>List the policy modules: <code>semodule -l</code>
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> SELinux Modes</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>In <code>/etc/selinux/config</code> file, <code>SELINUX</code> can be set to
<code>enforcing</code>, <code>disabled</code>, or <code>permissive</code>

<ol class="org-ol">
<li>Enforcing: Policy is loaded.  When SELinux is enforcing,
everything is denied by default and a policy determines
requested access.  See Figure 4.
</li>

<li>Permissive: Policy is loaded, but SELinux is <i>not enforcing</i>
it.  Accesses will be logged but not
prevented.  This mode is intended for testing and debugging.
</li>
<li>Disabled: SELinux infrastructure is not enabled. No policy
loaded.  Logs are not generated.
</li>
</ol>
</li>

<li>See also what the Grub boot entry should be for selinux to be
enabled (permissive or enforcing).
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> SELinux Logs</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Brute force check:: <code>grep -E 'avc:.*denied' -Rn /var/log</code> This will
grep all the files in /var/log recursively and report occurrences
with line numbers and file names.
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-11-26
</div>
</body>
</html>
